Hotakus/mp3-lvgl-stm32f405rgt/app/app_task.c
#include "app_task.h"
#include "lvgl.h"
#include "pro_conf.h"
#include "stm32f4xx_conf.h"
#include "led.h"

static rt_thread_t threadx[APP_THREAD_NUM] = {RT_NULL};

/* led闪烁线程 */
#define LED_THREAD_NAME         "led_blink"         // 线程名
#define LED_BLINK_STACK_SIZE    128                  // 线程栈大小
#define LED_BLINK_TIME_SLICE    1                   // 线程时间片
#define LED_BLINK_PRIOROTY      20                  // 线程优先级
static rt_thread_t *led_blink_th = &threadx[0];      // 从线程堆分配线程
static void led_blink_thread( void *param )
{
    param = param;
    led_conf( GPIOA, GPIO_Pin_8 );
    led_on( GPIOA, GPIO_Pin_8 );
    while ( 1 ) {
        led_on( GPIOA, GPIO_Pin_8 );
        rt_thread_mdelay( 500 );
        led_off( GPIOA, GPIO_Pin_8 );
        rt_thread_mdelay( 500 );
    }
}

/* lvgl tick线程 */
#define LVGL_TICK   10
#define LVGL_TICK_THREAD_NAME   "lvgl_tick"         // 线程名
#define LVGL_TICK_STACK_SIZE    128                // 线程栈大小
#define LVGL_TICK_TIME_SLICE    5                   // 线程时间片
#define LVGL_TICK_PRIOROTY      10                  // 线程优先级
static rt_thread_t *lvgl_tick_th = &threadx[1];      // 从线程堆分配线程
static void lvgl_tick_thread( void *param )
{
    param = param;
    while ( 1 ) {
        lv_tick_inc(LVGL_TICK);
        rt_thread_mdelay(LVGL_TICK);
    }
}

/* lvgl task handler线程 */
#define LVGL_TASK_THREAD_NAME   "lvgl_task"         // 线程名
#define LVGL_TASK_STACK_SIZE    2048                // 线程栈大小
#define LVGL_TASK_TIME_SLICE    10                   // 线程时间片
#define LVGL_TASK_PRIOROTY      10                  // 线程优先级
static rt_thread_t *lvgl_task_th = &threadx[2];      // 从线程堆分配线程
static void lvgl_task_thread( void *param )
{
    param = param;
    while ( 1 ) {
        lv_task_handler();
        rt_thread_mdelay(LVGL_TICK<<1);
    }
}

int app_create_task( void )
{
    /*  创建led闪烁线程 */
    *led_blink_th = rt_thread_create( 
        LED_THREAD_NAME,        /*线程名字*/                    
        led_blink_thread,       /*线程入口函数*/
        RT_NULL,                /*线程入口函数参数*/
        LED_BLINK_STACK_SIZE,   /*线程栈大小*/
        LED_BLINK_PRIOROTY ,    /*线程优先级*/
        LED_BLINK_TIME_SLICE    /*线程时间片*/
    );               
    if(led_blink_th !=RT_NULL)
        rt_thread_startup (*led_blink_th);
    else
        return -1;
    
    /*  创建lvgl tick线程 */
    *lvgl_tick_th = rt_thread_create( 
        LVGL_TICK_THREAD_NAME,        /*线程名字*/                    
        lvgl_tick_thread,             /*线程入口函数*/
        RT_NULL,                      /*线程入口函数参数*/
        LVGL_TICK_STACK_SIZE,         /*线程栈大小*/
        LVGL_TICK_PRIOROTY ,          /*线程优先级*/
        LVGL_TICK_TIME_SLICE          /*线程时间片*/
    );               
    if(lvgl_tick_th !=RT_NULL)
        rt_thread_startup (*lvgl_tick_th);
    else
        return -1;
    
    /*  创建lvgl task线程 */
    *lvgl_task_th = rt_thread_create( 
        LVGL_TASK_THREAD_NAME,        /*线程名字*/                    
        lvgl_task_thread,             /*线程入口函数*/
        RT_NULL,                      /*线程入口函数参数*/
        LVGL_TASK_STACK_SIZE,         /*线程栈大小*/
        LVGL_TASK_PRIOROTY ,          /*线程优先级*/
        LVGL_TASK_TIME_SLICE          /*线程时间片*/
    );               
    if(lvgl_task_th !=RT_NULL)
        rt_thread_startup (*lvgl_task_th);
    else
        return -1;

}
